app/views/publicacions/_publicacion.html.erb

SELECT "etiqueta".* FROM "etiqueta" INNER JOIN "etiqueta_publicacions" ON "etiqueta"."id" = "etiqueta_publicacions"."etiquetum_id" WHERE "etiqueta_publicacions"."publicacion_id" = $1  [["publicacion_id", 1]]
---
     <strong>Etiquetas:</strong>
     <% publicacion.etiqueta.each do |m| %>